[
  {
    "_id": "694e1d142f938a32a8b5218b",
    "title": "Worldwide Reach",
    "description": "Worldwide Reach enables businesses to access leads and opportunities across global markets effortlessly. By connecting with prospects internationally, it expands growth potential, enhances market presence, and ensures businesses can generate high-quality, targeted leads anywhere, anytime, driving sustainable global success",
    "image": "/uploads/growtool/1767097465828-311044433.png",
    "createdAt": "2025-12-26T05:28:52.149Z",
    "updatedAt": "2025-12-30T12:24:25.829Z",
    "__v": 0
  },
  {
    "_id": "694e5351ce1075f175c162f3",
    "title": "Instant Data Delivery",
    "description": "Instant Data Delivery provides businesses with real-time access to accurate, high-quality leads. By delivering actionable data immediately, it ensures faster decision-making, improved campaign efficiency, and seamless lead management, empowering teams to capitalize on opportunities without delay and drive growth effectively",
    "image": "/uploads/growtool/1767097455804-309268147.png",
    "createdAt": "2025-12-26T09:20:17.016Z",
    "updatedAt": "2025-12-30T12:24:15.805Z",
    "__v": 0
  },
  {
    "_id": "694e5383ce1075f175c16314",
    "title": "Intelligent Data Filtering",
    "description": "Intelligent Data Filtering ensures your leads are accurate and highly relevant by automatically analyzing, sorting, and prioritizing data. This advanced filtering process saves time, reduces errors, and delivers high-quality, targeted leads to help businesses achieve faster conversions and better results",
    "image": "/uploads/growtool/1767097445053-819557019.png",
    "createdAt": "2025-12-26T09:21:07.045Z",
    "updatedAt": "2025-12-30T12:24:05.054Z",
    "__v": 0
  },
  {
    "_id": "694e53e338e4260a09cbd146",
    "title": "Smart Lead Automation",
    "description": "Smart Lead Automation streamlines the entire lead generation process by automatically identifying, targeting, and nurturing high-quality prospects. It saves time, improves efficiency, and ensures businesses receive accurate, conversion-ready leads to accelerate growth and maximize marketing results effortlessly",
    "image": "/uploads/growtool/1767097403006-629564725.png",
    "createdAt": "2025-12-26T09:22:43.471Z",
    "updatedAt": "2025-12-30T12:23:23.008Z",
    "__v": 0
  }
]